package com.example.base;

/**
 * @author 李磊
 * @datetime 2020/3/21 19:48
 * @description
 */
public class Print {
    public static void main(String[] args) {
        /**
         * 本例使用idea白色主体测试
         *
         * esc字符八进制\033 \033[`参数1`;`参数2`;`参数3`...m
         * 可使用多个参数且顺序可随意排列 1~107内有效
         *
         * 1:粗体 3:斜体 4:下划线 7:反显 9:删除线
         *
         * 21:粗下划线
         *
         * 字体颜色
         * 30:黑 31:红 32:绿 33:黄 34:蓝 35:紫 36:青 37:灰
         * 90:深灰 91:亮红 92:亮绿 93:亮黄 94:亮蓝 95:亮紫 96:亮青 97:白
         *
         * 背景颜色
         * 40:黑 41:红 42:绿 43:黄 44:蓝 45:紫 46:青 47:灰
         * 100:深灰 101:亮红 102:亮绿 103:亮黄 104:亮蓝 105:亮紫 106:亮青 107:白
         *
         * 51:黑框 52:黑框
         *
         * 使用`\033[m`结束效果 否则会影响后面正常输出内容的样式
         * 参数直接使用`;`相隔 但不能以`;`结尾
         */
        byte[] arr1 = {30, 31, 32, 33, 34, 35, 36, 37};
        byte[] arr2 = {90, 91, 92, 93, 94, 95, 96, 97};
        for (byte b = 0; b < arr1.length; b++) {
            System.out.println("\033[" + arr1[b] + "m文本" + arr1[b] + "\033[m");
            System.out.println("\033[" + arr2[b] + "m文本" + arr2[b] + "\033[m");
        }
        for (int i = 1; i < 108; i++) {
            System.out.println("\033[" + i + "m文本" + i + "\033[m");
        }
    }
}